package com.lsh.atp.api.model.baseVo;

/**
 * lsh-atp
 * Created by peter on 16/8/3.
 */
public enum ExceptionStatus {

    /** 操作成功 */
    SUCCESS("OK","0"),

    /** 操作成功 */
    SUCCESS01("赠品库存不足","1"),

    /** 参数错误 */
    E1001001("参数异常","1001001"),

    /** 业务参数异常 */
    E1002001("业务参数异常","1002001"),

    /** 业务参数为空 */
    E1002002("业务参数为空","1002002"),

    /** 库存不足 */
    E2001001("库存不足","2001001"),

    /** 地址码匹配不到仓库区域 */
    E2001002("地址码匹配不到仓库区域码","2001002"),

    /** 待审核 */
    E2001003("商品数据不存在","2001003"),

    /** 业务参数异常 */
    E2001004("业务参数异常","2001004"),

    /** 数据问题 */
    E2001005("数据问题","2001005"),

    /** 还原失败 */
    E2001006("还原失败(该预占已经被还原 ，不能再次还原)","2001006"),

    /** 还原失败 */
    E2001007("还原失败","2001007"),

    /** 更新预占状态失败 */
    E2001008("更新预占状态失败","2001008"),

    /** 扣减失败 */
    E2001009("扣减失败(该预占已经被扣减，不能再次扣减)","2001009"),

    /** 区域码转换失败 */
    E2001010("区域码转换失败","2001010"),

    /** 未知预占状态 */
    E2001011("未知预占状态","2001011"),

    /** 操作流水号已存在 */
    E2001012("生成预占主记录失败 或 操作流水号已存在","2001012"),

    /** 预占信息不存在 */
    E2001013("预占信息不存在","2001013"),

    /** 预占信息已超时 */
    E2001014("预占信息已超时","2001014"),

    /** 生成预占主记录失败 */
    E2001015("生成预占主记录失败","2001015"),

    /** 商品库存不足或商品不存在 */
    E2001016("商品库存不足或商品不存在","2001016"),

    /** qty为大于0的正整数 */
    E2001017("qty为大于0的正整数","2001017"),

    /** 扣减失败 */
    E2001018("扣减失败","2001018"),

    /** 预占时间必须大于当前时间 */
    E2001019("预占时间必须大于当前时间","2001019"),

    /** redis赠品锁等待时间过长 **/
    E2001020("redis赠品锁等待时间过长","2001020"),

    /** 商品列表有重复 */
    E2001021("商品列表有重复","2001021"),

    /** 物美码不存在 */
    E2001022("物美码不存在","2001022"),

    /** item_id不存在 */
    E2001023("item_id不存在","2001023"),

    /** 两个品都为寄售仓库,或非寄售仓库 */
    E2001024("item_id不存在","2001024"),

    /** 扣减失败 */
    E2001025("扣减失败,sequence与hold_id不对应","2001025"),

    /** 扣减失败 */
    E2001026("扣减失败,channel与hold_id不对应","2001026"),

    /** 获取寄售仓库或非寄售仓库异常 */
    E2001027("获取寄售仓库或非寄售仓库异常","2001027"),

    /** 更新相同售卖规则 **/
    E2001039("不存在该售卖规则","2001039"),

    /** 更新相同售卖规则 **/
    E2001040("不能更新相同售卖规则","2001040"),

    /** 更新相同售卖规则 **/
    E2001041("更新商品售卖规则失败","2001041"),

    /** 更新相同售卖规则 **/
    E2001042("更新库存失败","2001042"),

    /** 调用商品服务失败 **/
    E2001043("调用商品服务失败","2001043"),

    E2001044("已存在该商品规则,新增商品失败","2001044"),

    E2001045("该地域没有对应的冻品仓库","2001045"),

    /** 商品售卖规则Redis更新失败**/
    E2001046("商品售卖规则Redis更新失败","2001046"),

    E2001047("当前商品在当前区域没有供货价","2001047"),

    /** 服务端异常 */
    E3001001("服务端异常","3001001"),;


    private final String message;

    private final String code;

    public String getMessage() {
        return message;
    }

    public String  getCode() {
        return code;
    }

    ExceptionStatus(String message, String code) {
        this.message = message;
        this.code = code;
    }



}
